In [9]:
import pandas as pd

df = pd.read_csv('Churn_Modeling.csv')

df.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,France,Male,27,2,134603.88,1,1,1,71725.73,0

In [10]:
invalid_rows = df[df['Surname'].str.contains('\?')]

if not invalid_rows.empty:

    print(invalid_rows)

else:

    print("No invalid rows here!")

      RowNumber  CustomerId Surname  CreditScore Geography  Gender  Age  \
9            10    15592389      H?          684    France    Male   27
329         330    15624528      L?          664   Germany    Male   26
437         438    15624623     Hs?          516    France    Male   35
941         942    15676521    Y?an          696    France  Female   31
970         971    15805955      L?          638    France  Female   48
...         ...         ...     ...          ...       ...     ...  ...
9633       9634    15668057      K?          669    France  Female   31
9704       9705    15759872      L?          625    France    Male   22
9792       9793    15787168      Y?          819     Spain  Female   28
9857       9858    15779423      K?          716    France    Male   39
9910       9911    15784042      L?          624    France    Male   55

      Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
9          2  134603.88              1          1               1
329        7  116244.14              2          1               1
437       10  104088.59              2          0               0
941        8       0.00              2          0               0
970       10  138333.03              1          1               1
...      ...        ...            ...        ...             ...
9633       6  113000.66              1          1               0
9704       9       0.00              2          1               0
9792       8  168253.21              1          1               1
9857       1   70657.61              2          1               1
9910       7  118793.60              1          1               1

      EstimatedSalary  Exited
9            71725.73       0
329          95145.14       0
437         119666.00       0
941         191074.11       0
970          47679.14       0
...               ...     ...
9633         40467.82       0
9704        157072.91       0
9792        102799.14       0
9857         76476.05       0
9910         95022.02       1

[92 rows x 14 columns]

In [11]:
df['Surname'] = df['Surname'].replace('?', 'Unknown')

In [12]:
invalid_rows = df[df['Surname'].str.contains('\?')]

if invalid_rows.empty:

    print(invalid_rows)

else:

    print("No invalid rows here!")

      RowNumber  CustomerId Surname  CreditScore Geography  Gender  Age  \
9            10    15592389      H?          684    France    Male   27
329         330    15624528      L?          664   Germany    Male   26
437         438    15624623     Hs?          516    France    Male   35
941         942    15676521    Y?an          696    France  Female   31
970         971    15805955      L?          638    France  Female   48
...         ...         ...     ...          ...       ...     ...  ...
9633       9634    15668057      K?          669    France  Female   31
9704       9705    15759872      L?          625    France    Male   22
9792       9793    15787168      Y?          819     Spain  Female   28
9857       9858    15779423      K?          716    France    Male   39
9910       9911    15784042      L?          624    France    Male   55

      Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
9          2  134603.88              1          1               1
329        7  116244.14              2          1               1
437       10  104088.59              2          0               0
941        8       0.00              2          0               0
970       10  138333.03              1          1               1
...      ...        ...            ...        ...             ...
9633       6  113000.66              1          1               0
9704       9       0.00              2          1               0
9792       8  168253.21              1          1               1
9857       1   70657.61              2          1               1
9910       7  118793.60              1          1               1

      EstimatedSalary  Exited
9            71725.73       0
329          95145.14       0
437         119666.00       0
941         191074.11       0
970          47679.14       0
...               ...     ...
9633         40467.82       0
9704        157072.91       0
9792        102799.14       0
9857         76476.05       0
9910         95022.02       1

[92 rows x 14 columns]

In [13]:
new_clean_surname = df['Surname'] = df['Surname'].apply(lambda x: 'Unknown' if '?' in x else x)
print(new_clean_surname)

0        Hargrave
1            Hill
2            Onio
3            Boni
4        Mitchell
          ...
9995     Obijiaku
9996    Johnstone
9997          Liu
9998    Sabbatini
9999       Walker
Name: Surname, Length: 10000, dtype: object

In [14]:
replacement_dict = {
    'HasCrCard': {0: 'No', 1: 'Yes'},
    'IsActiveMember': {0: 'No', 1: 'Yes'},
    'Exited': {0: 'No', 1: 'Yes'}
}

 

df.replace(replacement_dict, inplace=True)

 

df.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,Yes,Yes,101348.88,Yes
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,No,Yes,112542.58,No
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,Yes,No,113931.57,Yes
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,No,No,93826.63,No
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,Yes,Yes,79084.10,No
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,Yes,No,149756.71,Yes
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,Yes,Yes,10062.80,No
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,Yes,No,119346.88,Yes
8,9,15792365,He,501,France,Male,44,4,142051.07,2,No,Yes,74940.50,No
9,10,15592389,Unknown,684,France,Male,27,2,134603.88,1,Yes,Yes,71725.73,No